NordicPlayground/nrf528xx-ble-throughput-demo/ble_app_att_mtu_throughput/main.c
    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);
}


void data_len_ext_set(bool status)
{
    ret_code_t err_code;
    ble_opt_t  opt;

	uint16_t pdu_size = status ?
        (m_test_params.att_mtu + LL_HEADER_LEN) : BLE_GATT_MTU_SIZE_DEFAULT + LL_HEADER_LEN;
	
	if(pdu_size > 251)
	{
		pdu_size = 251;
	}
	
    memset(&opt, 0x00, sizeof(opt));
    opt.gap_opt.ext_len.rxtx_max_pdu_payload_size = pdu_size;

    err_code = sd_ble_opt_set(BLE_GAP_OPT_EXT_LEN, &opt);
    NRF_LOG_DEBUG("Setting DLE to %u: 0x%x\r\n", status, err_code);
    APP_ERROR_CHECK(err_code);
}


void preferred_phy_select(void)
{
    NRF_LOG_INFO("Select preferred PHY:\r\n");
    NRF_LOG_INFO(" 1) 1 MBit.\r\n");
    NRF_LOG_INFO(" 2) 2 MBits.\r\n");
    NRF_LOG_INFO(" 3) Coded.\r\n");
    NRF_LOG_FLUSH();

	display_clear();
	display_test_params_print();
	
	display_print_line_inc("Select preferred PHY:");
	display_print_line_inc(" 1) 1 MBit.");
	display_print_line_inc(" 2) 2 MBit.");
	display_print_line_inc(" 3) Coded.");
	display_show();
	
    switch (button_read())
    {
        default:
        case BUTTON_1:
            m_test_params.rxtx_phy = BLE_GAP_PHY_1MBPS;
            break;

        case BUTTON_2:
            m_test_params.rxtx_phy = BLE_GAP_PHY_2MBPS;
            break;

        case BUTTON_3:
            m_test_params.rxtx_phy = BLE_GAP_PHY_CODED;
            break;
    }

	preferred_phy_set(m_test_params.rxtx_phy);

    NRF_LOG_INFO("Preferred PHY set to %s.\r\n", phy_str(m_test_params.rxtx_phy));
    NRF_LOG_FLUSH();
}

void att_mtu_select(void)
{
    NRF_LOG_INFO("Select an ATT MTU size:\r\n");
    NRF_LOG_INFO(" 1) 23 bytes.\r\n");
    NRF_LOG_INFO(" 2) 158 bytes.\r\n");
    NRF_LOG_INFO(" 3) 247 bytes.\r\n");
    NRF_LOG_FLUSH();
	
	display_clear();
	display_test_params_print();
	
	display_print_line_inc("Select an ATT MTU size:");
	display_print_line_inc(" 1) 23 bytes.");
	display_print_line_inc(" 2) 158 bytes.");
	display_print_line_inc(" 3) 247 bytes.");
	display_show();

    switch (button_read())
    {
        case BUTTON_1:
        default:
            m_test_params.att_mtu = 23;
            break;

        case BUTTON_2:
            m_test_params.att_mtu = 158;
            break;

        case BUTTON_3:
            m_test_params.att_mtu = 247;
            break;
    }

    gatt_mtu_set(m_test_params.att_mtu);
	data_len_ext_set(m_test_params.data_len_ext_enabled);
	
    NRF_LOG_INFO("ATT MTU set to %d bytes.\r\n", m_test_params.att_mtu);
    NRF_LOG_FLUSH();
}


void conn_interval_select(void)
{
    NRF_LOG_INFO("Select a connection interval:\r\n");
    NRF_LOG_INFO(" 1) 7.5 ms\r\n");
    NRF_LOG_INFO(" 2) 50 ms\r\n");
    NRF_LOG_INFO(" 3) 400 ms\r\n");
    NRF_LOG_FLUSH();
	
	display_clear();
	display_test_params_print();
	
	display_print_line_inc("Select a connection interval:");
	display_print_line_inc(" 1) 7.5 ms");
	display_print_line_inc(" 2) 50 ms");
	display_print_line_inc(" 3) 400 ms");
	display_show();

    switch (button_read())
    {
        case BUTTON_1:
        default:
            m_test_params.conn_interval = (uint16_t)(MSEC_TO_UNITS(7.5, UNIT_1_25_MS));
            break;

        case BUTTON_2:
            m_test_params.conn_interval = (uint16_t)(MSEC_TO_UNITS(50, UNIT_1_25_MS));
            break;

        case BUTTON_3:
            m_test_params.conn_interval = (uint16_t)(MSEC_TO_UNITS(400, UNIT_1_25_MS));
            break;
    }

    NRF_LOG_INFO("Connection interval set to 0x%x.\r\n", m_test_params.conn_interval);
    NRF_LOG_FLUSH();
}


void data_len_ext_select(void)
{
    NRF_LOG_INFO("Turn on Data Length Extension? (y/n)\r\n");
    NRF_LOG_FLUSH();
	
	display_clear();
	display_test_params_print();
	
	display_print_line_inc("Turn on Data Length Extension?");
	display_print_line_inc(" 1) Yes");
	display_print_line_inc(" 2) No");
	display_show();

    uint8_t answer = button_read();
    NRF_LOG_INFO("Data Length Extension is %s\r\n", (answer == BUTTON_1) ?
                 (uint32_t) "ON" :
                 (uint32_t) "OFF");
    NRF_LOG_FLUSH();

    m_test_params.data_len_ext_enabled = (answer == YES) ? 1 : 0;

    data_len_ext_set(m_test_params.data_len_ext_enabled);
}

bool test_param_adjust_page_1(void)
{
    bool done = false;
	bool back = false;

    while (!done)
    {
        NRF_LOG_INFO("Adjust test parameters.\r\n");
        NRF_LOG_INFO(" 1) Select ATT MTU size.\r\n");
        NRF_LOG_INFO(" 2) Select connection interval.\r\n");
        NRF_LOG_INFO(" 3) Next page.\r\n");
		NRF_LOG_INFO(" 4) Back.\r\n")
        NRF_LOG_FLUSH();
		
		display_clear();
		
		display_test_params_print();
		
		display_print_line_inc("Adjust test parameters");
        display_print_line_inc(" 1) Select ATT MTU size");
        display_print_line_inc(" 2) Select connection interval");
        display_print_line_inc(" 3) Next page.");
        display_print_line_inc(" 4) Back.");
        display_show();

        switch (button_read())
        {
            case BUTTON_1:
                att_mtu_select();
                break;

            case BUTTON_2:
                conn_interval_select();
                break;

            case BUTTON_3:
				done = true;
                break;

            case BUTTON_4:
            default:
				back = true;
                done = true;
                break;
        }
    }
	return back;
}

bool test_param_adjust_page_2(void)
{
    bool done = false;
	bool back = false;

    while (!done)
    {
        NRF_LOG_INFO("Adjust test parameters.\r\n");
        NRF_LOG_INFO(" 1) Turn on/off Data length extension (DLE).\r\n");
		NRF_LOG_INFO(" 2) Select preferred PHY.\r\n")
		NRF_LOG_INFO(" 3) Next page.\r\n");
		NRF_LOG_INFO(" 4) Back.\r\n")
        NRF_LOG_FLUSH();
		
		display_clear();
		
		display_test_params_print();
		
		display_print_line_inc("Adjust test parameters");
        display_print_line_inc(" 1) Turn on/off Data length extension (DLE)");
        display_print_line_inc(" 2) Select preferred PHY.");
		display_print_line_inc(" 3) Next page.");
        display_print_line_inc(" 4) Back.");
        display_show();

        switch (button_read())
        {
            case BUTTON_1:
                data_len_ext_select();
                break;

            case BUTTON_2:
                preferred_phy_select();
                break;

            case BUTTON_3:
                done = true;
                break;

