NordicPlayground/nrf528xx-ble-throughput-demo/ble_app_att_mtu_throughput/main.c
            case BUTTON_4:
            default:
				back = true;
                done = true;
                break;
        }
    }
	return back;
}

void test_param_adjust(void)
{
	bool back = false;
	uint8_t page = 0;
	
	while(!back)
	{
		if(page == 0)
		{
			back = test_param_adjust_page_1();
			page++;
		}
		else
		{
			back = test_param_adjust_page_2();
			page = 0;
		}
	}
}

void test_params_print(void)
{
    NRF_LOG_RAW_INFO("\r\n");
    NRF_LOG_INFO("Current test configuration:\r\n");
    NRF_LOG_INFO("===============================\r\n");
    NRF_LOG_INFO("ATT MTU size: %d\r\n", m_test_params.att_mtu);
	NRF_LOG_INFO("Preferredy PHY: %s\r\n", phy_str(m_test_params.rxtx_phy));
    NRF_LOG_INFO("Conn. interval: 0x%x\r\n", m_test_params.conn_interval);
    NRF_LOG_INFO("Data length extension (DLE): %s\r\n", m_test_params.data_len_ext_enabled ?
                 (uint32_t)"ON" :
                 (uint32_t)"OFF");
    NRF_LOG_INFO("Conn. event length ext.: %s\r\n", m_test_params.conn_evt_len_ext_enabled ?
                 (uint32_t)"ON" :
                 (uint32_t)"OFF");
    NRF_LOG_INFO("===============================\r\n");
    NRF_LOG_RAW_INFO("\r\n");
    NRF_LOG_FLUSH();
    
}

void display_test_params_print()
{
	char str[50];
	
	sprintf(str, "ATT MTU size: %d bytes", m_test_params.att_mtu);
	display_print_line_inc(str);
	
	sprintf(str, "Preferredy PHY: %s\r\n", phy_str(m_test_params.rxtx_phy));
	display_print_line_inc(str);
	
    sprintf(str, "Conn. interval: %.2f ms", (float)m_test_params.conn_interval * 1.25);
	display_print_line_inc(str);
    
	sprintf(str, "Data length extension (DLE): %s", m_test_params.data_len_ext_enabled ?
                 (uint32_t)"ON" :
                 (uint32_t)"OFF");
	display_print_line_inc(str);
	/*
    sprintf(str, "Conn. event length ext.: %s", m_test_params.conn_evt_len_ext_enabled ?
                 (uint32_t)"ON" :
                 (uint32_t)"OFF");
	display_print_line_inc(str);
	*/
}


void test_begin(void)
{
    NRF_LOG_INFO("Preparing the test.\r\n");
    NRF_LOG_FLUSH();
	
	display_clear();
	//display_print_line_inc("Preparing the test.\r\n");
	display_show();

    switch (m_gap_role)
    {
        default:
            // If no connection was established, the role won't be either.
            // In this case, start both advertising and scanning.
            advertising_start();
            scan_start();
            break;

        case BLE_GAP_ROLE_PERIPH:
            advertising_start();
            break;

        case BLE_GAP_ROLE_CENTRAL:
            scan_start();
            break;
    }
}


void menu_print(void)
{
    bool begin_test = false;

    while (!begin_test)
    {
		display_clear();
        test_params_print();
		display_test_params_print();
		
        NRF_LOG_INFO("Select an option:\r\n");
        NRF_LOG_INFO(" 1) Run test.\r\n");
        NRF_LOG_INFO(" 2) Adjust test parameters.\r\n");
        NRF_LOG_FLUSH();

		display_print_line_inc("Select an option:\r\n");
        display_print_line_inc(" 1) Run test.\r\n");
        display_print_line_inc(" 2) Adjust test parameters.\r\n");
		display_show();
		
        switch (button_read())
        {
            case BUTTON_1:
            default:
                begin_test = true;
                test_begin();
                break;

            case BUTTON_2:
                test_param_adjust();
                break;
        }
    }

    m_print_menu = false;
}


static bool is_test_ready()
{
    if (   (m_board_role == BOARD_TESTER)
        && m_conn_interval_configured
        && m_notif_enabled
        && m_mtu_exchanged
        && m_phy_updated
        && !m_run_test)
    {
        return true;
    }
    return false;
}


int main(void)
{
    log_init();
	
	bool display_connected = false;
	//comment out display_init if no display is attached
	display_connected = display_init();
	
    leds_init();
    timer_init();
    counter_init();
	if(display_connected)
	{
		#ifdef NRF52840_XXAA
			buttons_init(buttons);
		#endif
		#ifdef NRF52832
			buttons_init(buttons_display_pca10040);
		#endif
	}
	else
	{
		buttons_init(buttons);
	}

    ble_stack_init();

    gap_params_init();
    conn_params_init();
    gatt_init();
    advertising_data_set();
	

    server_init();
    client_init();

    gatt_mtu_set(m_test_params.att_mtu);
    data_len_ext_set(m_test_params.data_len_ext_enabled);
    conn_evt_len_ext_set(m_test_params.conn_evt_len_ext_enabled);
    preferred_phy_set(m_test_params.rxtx_phy);

    NRF_LOG_INFO("ATT MTU example started.\r\n");
    NRF_LOG_INFO("Press button 1 on the board connected to the PC.\r\n");
    NRF_LOG_INFO("Press button 2 on other board.\r\n");
    NRF_LOG_FLUSH();
	
	display_clear();
	display_print_line_inc("ATT MTU example started.\r\n");
    display_print_line_inc("Press button 1 on the board");
	display_print_line_inc("connected to the PC.");
    display_print_line_inc("Press button 2 on other board.");
	display_show();

    uint8_t button = button_read();

	if(button == BUTTON_1)
	{
		m_board_role = BOARD_TESTER;
	}
	else
	{
		m_board_role = BOARD_DUMMY;
	}

    if (m_board_role == BOARD_TESTER)
    {
        m_print_menu = true;
    }
    if (m_board_role == BOARD_DUMMY)
    {
        advertising_start();
        scan_start();
    }

    // Enter main loop.
    NRF_LOG_INFO("Entering main loop.\r\n");
    for (;;)
    {
		
		if(m_transfer_done)
		{
			display_print_line_inc("");
			display_print_line_inc("Press any button to exit.");
			display_show();
			
			button_read();
			m_transfer_done = false;
		}
		
        if (m_print_menu && !m_transfer_done)
        {
            menu_print();
        }

        if (is_test_ready())
        {
			//clear data from the last transfer
			m_display_show_transfer_data = false;
			m_transfer_data.kB_transfered = 0;
			
            m_run_test = true;
            test_run();
        }

		if(m_display_show_transfer_data)
		{
			display_draw_test_run_screen(&m_transfer_data);
			m_display_show_transfer_data = false;
		}
		
		if(m_display_show)
		{
			display_show();
			m_display_show = false;
		}
		
        if (!NRF_LOG_PROCESS())
        {
            wait_for_event();
        }

    }
}


/**
 * @}
 */
